0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
  	\\  /    A nd           | Version:  dev
  	 \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#include "ablTerrain.dict"


Uref                 1;

Zref                 3380.0;
zDir                 (0 0 1);

z0                   uniform 2100;


// ************************************************************************* //
