0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (4.119077881997793 -9.47323056839833 0.0);
pressure             10135;
turbulentKE          1.3;
turbulentEpsilon     0.01;
temperatureField     283.15;

// ************************************************************************* //
