0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{
    outlet 
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    inlet 
    {
        type            atmBoundaryLayerInletK;
        #include        "include/ABLConditions"
    }

    terrain
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    
    theVent
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }
    
    
    

    ground
    {
        type            zeroGradient;
    }
    
    
    top
    {
        type slip;
    }

    east
    {
        type slip;
    }

    west
    {
        type slip;
    }

    "proc.*"
    {
        type            processor;
    }
    //#include "include/sideAndTopPatches"
}


// ************************************************************************* //
