0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    inlet 
    {
        type            calculated;
        value           uniform 0;
    }

    outlet 
    {
        type            calculated;
        value           uniform 0;
    }

    terrain
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
    }

    
    theVent
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
    }
    

    ground
    {
        
        type            calculated;
        value           uniform 0;
    }

    top
    {
        type slip;
    }

    east
    {
        type slip;
    }

    west
    {
        type slip;
    }

    "proc.*"
    {
        type            processor;
    }
    //#include "include/sideAndTopPatches"
}


// ************************************************************************* //
