0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        
        type            uniformFixedValue;
        uniformValue    constant $pressure;
    }

    terrain
    {
        type            zeroGradient;
    }

    
    theVent
    {
        type            zeroGradient;
    }
    
    
    ground
    {
        type            zeroGradient;
    }
    
    top
    {
        type slip;
    }

    east
    {
        type slip;
    }

    west
    {
        type slip;
    }

    "proc.*"
    {
        type            processor;
    }
    //#include "include/sideAndTopPatches"
}

// ************************************************************************* //
